app/controllers/assets_controller.rb

SELECT "assets".* FROM "assets"
---
	def index
		@assets = Asset.all

SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "2"]]
---
	def show
		@asset = Asset.find(params[:id])

SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "2"]]
---
	def edit
		@asset = Asset.find(params[:id])

INSERT INTO "assets" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 15 Apr 2013 23:44:34 UTC +00:00], ["description", nil], ["title", nil], ["updated_at", Mon, 15 Apr 2013 23:44:34 UTC +00:00]]
---
	def create
		@asset = Asset.new(params[:asset])

		respond_to do |format|
			if @asset.save

SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "2"]]
---
	def update
		@asset = Asset.find(params[:id])

SELECT "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "assets" WHERE "assets"."id" = $1  [["id", 1]]
---
	def destroy
		@asset = Asset.find(params[:id])
		@asset.destroy