app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
	def index
		@pages = Page.all

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def show
		@page = Page.find(params[:id])

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def edit
		@page = Page.find(params[:id])

INSERT INTO "pages" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 15 Apr 2013 18:04:46 UTC +00:00], ["description", "stuff"], ["title", "Test page"], ["updated_at", Mon, 15 Apr 2013 18:04:46 UTC +00:00]]
---
	def create
		@page = Page.new(params[:page])

		respond_to do |format|
			if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 2]]
---
	def destroy
		@page = Page.find(params[:id])
		@page.destroy